import { useState } from "react";
import { LeftArrowSlider } from "./svgs/LeftArrowSlider";

const AboutCategory = () => {
  const [showText, setShowText] = useState(false);

  return (
    <div className="px-4 xl:px-20">
      <div className="bg-light p-8">
        <h4 className="text-[32px]">
          کالاهای دیجیتال در فروشگاه اینترنتی تیمچه
        </h4>
        <p className="about-category__text">
          کالاهای دیجیتال همان کالاهایی هستند که زندگی امروزی ما را ساخته‌اند.
          از چند دهه پیش که کالاهای دیجیتال در جهان عرضه شدند و عصر دیجیتال را
          ساختند، کم‌کم سبک زندگی ما در هر زمینه‌ای از جمله زندگی شخصی،
          کسب‌وکارها، آموزش، سرگرمی و حتی فعالیت‌های مدنی دستخوش تغییر شد.
          امروزه دیگر آرزوهای ما هم رنگ دیگری به خود گرفتند و بسیاری از آنها در
          قالب این سبک زندگی معنا می‌گیرند. برای رفع نیازهای روزمره، ادامه تحصیل
          و اشتغال، برقراری روابط انسانی و خرید هدیه، کالاهای دیجیتال جای خود را
          در سبد خرید ما باز کرده‌اند.
        </p>
        {showText && (
          <>
            <h4 className="text-[32px]">خرید آنلاین کالای دیجیتال</h4>
            <p className="about-category__text">
              خرید آنلاین کالاهای دیجیتال، حالا نه یک روش جدید و متفاوت برای
              عاشقان تکنولوژی، بلکه تبدیل به ضرورتی برای همگان شده است. یک
              نوجوان محصل، یک جوان در آستانه اشتغال یا راه‌اندازی کسب‌وکار خود،
              یک تاجر بین‌المللی یا یک شهروند عادی در دنیای دیجیتال، نیازهای خود
              را در بستر دیجیتال می‌جوید و کالاهای دیجیتال از دسته‌بندی‌هایی است
              که بیشترین جست‌وجوی آن‌ها را به خود اختصاص می‌دهند. از سوی دیگر
              صنایعی که عهده‌دار تولید کالاهای دیجیتال هستند، در سراسر دنیا
              به‌سرعت به رشد رسیدند. به‌نحوی که گفته می‌شود در طول تاریخ بشریت،
              پیشرفت در هیچ حوزه‌ای تا به این اندازه پرشتاب و پویا نبوده است.
              رقابت بر سر عرضه بهترین و جدیدترین کالاها، در طول همین یکی دو دهه
              به‌نحوی تنگاتنگ بوده که به‌ندرت می‌توان یک محصول دیجیتال خاص را
              یافت که بیش از یکی دو سال یکه‌تاز باشد! تکنولوژی دست در دست
              برندهای فعال تولیدکننده، هرروز روی جالب‌تر و البته آسان‌تری از
              زندگی را برای کاربران به نمایش می‌گذارد و در ازای آن، رشد و
              سرمایه‌گذاری روزافزون را برای خود به ارمغان می‌برد. برندهایی که
              مثل گوگل، به‌عنوان غول‌های تکنولوژی شناخته می‌شوند، به منظور ساخت
              بستر بهتری برای ارائه خدمات خود، به تولید کالاهای دیجیتال روی
              آوردند و برعکس، تولیدکننده‌هایی مثل اپل نیز در بستری که از پیش
              ارائه داده بودند، روزبه‌روز خدمات بیشتری را عرضه کردند. حتی صنایعی
              که پیش از آن درگیر تولید محصولات در دسته‌بندی‌های دیگری بودند، رو
              به دنیای کالاهای دیجیتال آوردند و در نتیجه، برندهایی مثل ال‌جی و
              سامسونگ در این صنعت شناخته شدند و به‌زودی نام‌های دیگری مثل هواوی
              و شیائومی نیز به فهرست رقیبان جدی اضافه شدند. حالا دیگر باید گفت
              هر تولیدکننده‌ای که سودای سهم‌گیری از بازار جهانی را دارد، باید
              نظری هم به کالاهای دیجیتال یا دست کم بهره‌گیری از ابزارهای دیجیتال
              داشته باشد. در تیمچه، دسته‌بندی کالاهای دیجیتال را مطابق آنچه در
              واقعیت با آن روبه‌رو هستیم، محدود به کالاهایی مثل موبایل، تبلت و
              لپ‌تاپ ندانسته‌ایم و طیف وسیعی از کالاها را در حوزه‌های سلامت،
              سرگرمی، هنر و آموزش را گرد هم آورده‌ایم؛ از دوربین، کنسول بازی،
              پرینترو گجت‌های سلامتی مثل بند و ساعت هوشمند گرفته تا تجهیزات و
              لوازم جانبی موردنیاز آنها. برای خرید آنلاین کالاهای دیجیتال از
              فروشگاه اینترنتی تیمچه با تضمین اصالت کالاها و تامین از منابع
              معتبر، گزینه‌های متناسب با هر بودجه و سلیقه‌ای در اختیار کاربران
              قرار گرفته است. از آنجا که تیمچه از مدل تجاری بازارگاه (Market
              Place) تبعیت می‌کند، با فروشندگان متنوعی از سراسر کشور همکاری دارد
              و از همین رو، قیمت موبایل، لپ‌تاپ یا هر کالای دیگری که در جست‌وجوی
              آن باشید، در یک بستر رقابتی تعیین شده و با اعمال نظارت‌های لازم،
              روی وب‌سایت قرار می‌گیرد.
            </p>
          </>
        )}
        <div
          className="text-[13px] text-grayDark flex justify-center text-center gap-x-4 cursor-pointer"
          onClick={() => setShowText(!showText)}
        >
          <span>{showText ? "بستن" : "نمایش بیشتر"}</span>
          <div>
            <LeftArrowSlider
              className={`w-3 h-3 mt-[6px] ${
                showText ? "rotate-90" : "-rotate-90"
              }`}
            />
          </div>
        </div>
      </div>
    </div>
  );
};

export default AboutCategory;
