const FooterText = () => {
  return (
    <div className="px-4 py-6 bg-light lg:px-20">
      <h6 className="mb-4">تیمچه، خرید آنلاین همه نوع کالا</h6>
      <p className="text-[12px] text-secondary leading-[24px]">
        تیمچه، فروشگاهی اینترنتی با مدل بازارگاه یا «MarketPlace» است که با تنوع
        ده‌ها هزار کالا در دسته‌های متفاوت، خرید آنلاین همه‌چیز را برای همه در
        سراسر کشور امکان‌پذیر کرده است. لندو، اولین و بزرگ‌ترین استارتاپ ایرانی
        در حوزه خرید اقساطی،‌ فروشگاه اینترنتی تیمچه را راه‌اندازی کرده است.
        ضمانت اصل بودن کالا، ضمانت ده‌روزه بازگشت کالا، پشتیبانی در هفت روز هفته
        و امکان خرید اقساطی کالاها، مزایایی است که تیمچه برای خلق یک تجربه
        متفاوت از خرید آنلاین فراهم کرده است. در تیمچه سبدهایتان را با هرچیزی که
        در فکرش بودید، پر می‌کنیم. از موبایل و تلویزیون و دوربین گرفته تا ساز و
        ابزار و پوشیدنی و خوردنی!
      </p>
    </div>
  );
};

export default FooterText;
