const ProductReview = () => {
  return (
    <div className="text-[14px] flex flex-col gap-y-4 leading-[32px] text-grayDark px-4 py-6 lg:px-8 lg:py-10">
      <p>
        هدفون HE05X لنوو که قیمت فوق‌العاده‌ای دارد، کیفیت قابل قبولی را هم به
        همراه دارد. در واقع با هزینه‌ای معقول می‌توانید یک هدفون بی‌سیم که روی
        گردن قرار می‌گیرید داشته باشید. شرکت لنوو این محصول را به گونه‌ای طراحی
        شده که کاربران بتوانند مدل‌ زمان زیادی از ان استفاده کنند و همیشه کیفیت
        صدای خوبی را بشوند. روی این هدفون بی‌سیم از بلوتوث 5 استفاده شده که
        کیفیت پخش موسیقی را بالابرده و روند اتصال به دستگاه‌های مختلف را هم
        سریع‌ کرده است. از طرف دیگر میکروفن‌های هدفون HE05X به تکنولوژی حذف صدای
        مزاحم مجهز شده‌اند.
      </p>
      <p>
        ظرفیت باتری این هدفون هم انقدر بالا است که باعث شده بتوانید با HE05X
        لنوو تا هشت ساعت موسیقی گوش کنید. باتری 80 میلی‌آمپر ساعتی این محصول
        باعث شده که هدفون تا 120 ساعت در حالت آماده به‌کار باقی بماند. بلندگوهای
        این محصول توانسته‌اند صدای استریو شفاف و باکیفیتی را خلق کنند که برای
        گوش دادن موسیقی و حتی گوش کردن به صدای بازی ها و فیلم دیدن مناسب است.
      </p>
      <p>
        زمانی که این هدفون را به گوشی متصل می‌کنید، میزان شارژ‌ آن را می‌توانید
        از داخل گوشی مشاهده کنید. به این صورت متوجه خواهید شد که کی باید این
        محصول را شارژ‌ کنید. روی این محصول دکمه‌هایی برای پخش و توقف موسیقی قرار
        گرفته است. می‌توانید صدا را کم و زیاد کنید و حتی می‌توانید به تماس‌های
        دریافتی پاسخ دهید. هدفون HE05X لنوو دربرابر نفوذ گرد و خاک و رطوبت مقاوم
        است؛ اما ضد آب نیست.
      </p>
      <p>
        این هدفون که روی گردن قرار می‌گیرد وزن بسیار کمی دارد و وجود آن را احساس
        نخواهید کرد. همچنین از انعطاف پذیری بالایی هم برخوردار است. سه اندازه
        مختلف هم برای توگوشی‌ها این هدفون در نظر گرفته شده که تا بتوانید از آن
        بهتر استفاده کنید. در کل این محصول برای استفاده‌های روزانه انتخاب بسیار
        مناسبی خواهد بود.
      </p>
    </div>
  );
};

export default ProductReview;
