import { useState } from "react";
import ReactPaginate from "react-paginate";
import UserComment from "./UserComment";

const UsersCommentsBox = () => {
  const [itemsPerPage, setItemsPerPage] = useState<number>(4);

  const [itemOffset, setItemOffset] = useState(0);

  const endOffset = itemOffset + itemsPerPage;
  const currentItems = comments.slice(itemOffset, endOffset);
  const pageCount = Math.ceil(comments.length / itemsPerPage);

  // Invoke when user click to request another page.
  const handlePageClick = (event: any) => {
    const newOffset = (event.selected * itemsPerPage) % comments.length;
    setItemOffset(newOffset);
  };

  return (
    <>
      <div className="mb-12">
        {currentItems.map(({ id, userName, shortComment, longComment }) => (
          <UserComment
            key={id}
            userName={userName}
            offerToBuy
            longComment={longComment}
            shortComment={shortComment}
          />
        ))}
      </div>
      <ReactPaginate
        className="flex flex-wrap items-center justify-center gap-x-2"
        pageLinkClassName="page-link transition-all duration-300 hover:bg-blue hover:text-white"
        activeLinkClassName="bg-blue text-white"
        nextLinkClassName="page-link"
        previousLinkClassName="page-link"
        breakLabel="..."
        nextLabel=">"
        onPageChange={handlePageClick}
        pageRangeDisplayed={5}
        pageCount={pageCount}
        previousLabel="<"
        renderOnZeroPageCount={null}
      />
    </>
  );
};

export default UsersCommentsBox;

const comments = [
  {
    id: 1,
    userName: "کاربر تیمچه",
    shortComment: "بسیار با کیفیت",
    offerToBuy: true,
    longComment:
      "این محصول رو برای باشگاه خریداری کردم چونکه نمیخواستم درگیر کیس هندزفری بشم و راحت روی گردنم میدازم از مزایای این محصول میتونم به صدای بسیار با کیفیت و اتصال آسان با هر دستگاه و نگهداشتن شارژ عالی اشاره کنم بعضی اوقات که پیاده به سرکار میرم هم از این محصول استفاده میکنم ویه جورایی معتاد این هندزفری شدم و این نکته رو هم اضافه کنم که قبل از این محصول چند هندزفری دیگر هم گرفتم که به گوش هام نمیخورد و میوفتاد اما این بسیار اوکیه پیشنهاد میکنم حتما بخرید",
  },
  {
    id: 2,
    userName: "کاربر تیمچه",
    shortComment: "بسیار با کیفیت",
    offerToBuy: true,
    longComment:
      "این محصول رو برای باشگاه خریداری کردم چونکه نمیخواستم درگیر کیس هندزفری بشم و راحت روی گردنم میدازم از مزایای این محصول میتونم به صدای بسیار با کیفیت و اتصال آسان با هر دستگاه و نگهداشتن شارژ عالی اشاره کنم بعضی اوقات که پیاده به سرکار میرم هم از این محصول استفاده میکنم ویه جورایی معتاد این هندزفری شدم و این نکته رو هم اضافه کنم که قبل از این محصول چند هندزفری دیگر هم گرفتم که به گوش هام نمیخورد و میوفتاد اما این بسیار اوکیه پیشنهاد میکنم حتما بخرید",
  },
  {
    id: 3,
    userName: "کاربر تیمچه",
    shortComment: "بسیار با کیفیت",
    offerToBuy: true,
    longComment:
      "این محصول رو برای باشگاه خریداری کردم چونکه نمیخواستم درگیر کیس هندزفری بشم و راحت روی گردنم میدازم از مزایای این محصول میتونم به صدای بسیار با کیفیت و اتصال آسان با هر دستگاه و نگهداشتن شارژ عالی اشاره کنم بعضی اوقات که پیاده به سرکار میرم هم از این محصول استفاده میکنم ویه جورایی معتاد این هندزفری شدم و این نکته رو هم اضافه کنم که قبل از این محصول چند هندزفری دیگر هم گرفتم که به گوش هام نمیخورد و میوفتاد اما این بسیار اوکیه پیشنهاد میکنم حتما بخرید",
  },
  {
    id: 4,
    userName: "کاربر تیمچه",
    shortComment: "بسیار با کیفیت",
    offerToBuy: true,
    longComment:
      "این محصول رو برای باشگاه خریداری کردم چونکه نمیخواستم درگیر کیس هندزفری بشم و راحت روی گردنم میدازم از مزایای این محصول میتونم به صدای بسیار با کیفیت و اتصال آسان با هر دستگاه و نگهداشتن شارژ عالی اشاره کنم بعضی اوقات که پیاده به سرکار میرم هم از این محصول استفاده میکنم ویه جورایی معتاد این هندزفری شدم و این نکته رو هم اضافه کنم که قبل از این محصول چند هندزفری دیگر هم گرفتم که به گوش هام نمیخورد و میوفتاد اما این بسیار اوکیه پیشنهاد میکنم حتما بخرید",
  },
  {
    id: 5,
    userName: "کاربر تیمچه",
    shortComment: "بسیار با کیفیت",
    offerToBuy: true,
    longComment:
      "این محصول رو برای باشگاه خریداری کردم چونکه نمیخواستم درگیر کیس هندزفری بشم و راحت روی گردنم میدازم از مزایای این محصول میتونم به صدای بسیار با کیفیت و اتصال آسان با هر دستگاه و نگهداشتن شارژ عالی اشاره کنم بعضی اوقات که پیاده به سرکار میرم هم از این محصول استفاده میکنم ویه جورایی معتاد این هندزفری شدم و این نکته رو هم اضافه کنم که قبل از این محصول چند هندزفری دیگر هم گرفتم که به گوش هام نمیخورد و میوفتاد اما این بسیار اوکیه پیشنهاد میکنم حتما بخرید",
  },
  {
    id: 6,
    userName: "کاربر تیمچه",
    shortComment: "بسیار با کیفیت",
    offerToBuy: true,
    longComment:
      "این محصول رو برای باشگاه خریداری کردم چونکه نمیخواستم درگیر کیس هندزفری بشم و راحت روی گردنم میدازم از مزایای این محصول میتونم به صدای بسیار با کیفیت و اتصال آسان با هر دستگاه و نگهداشتن شارژ عالی اشاره کنم بعضی اوقات که پیاده به سرکار میرم هم از این محصول استفاده میکنم ویه جورایی معتاد این هندزفری شدم و این نکته رو هم اضافه کنم که قبل از این محصول چند هندزفری دیگر هم گرفتم که به گوش هام نمیخورد و میوفتاد اما این بسیار اوکیه پیشنهاد میکنم حتما بخرید",
  },
  {
    id: 7,
    userName: "کاربر تیمچه",
    shortComment: "بسیار با کیفیت",
    offerToBuy: true,
    longComment:
      "این محصول رو برای باشگاه خریداری کردم چونکه نمیخواستم درگیر کیس هندزفری بشم و راحت روی گردنم میدازم از مزایای این محصول میتونم به صدای بسیار با کیفیت و اتصال آسان با هر دستگاه و نگهداشتن شارژ عالی اشاره کنم بعضی اوقات که پیاده به سرکار میرم هم از این محصول استفاده میکنم ویه جورایی معتاد این هندزفری شدم و این نکته رو هم اضافه کنم که قبل از این محصول چند هندزفری دیگر هم گرفتم که به گوش هام نمیخورد و میوفتاد اما این بسیار اوکیه پیشنهاد میکنم حتما بخرید",
  },
  {
    id: 8,
    userName: "کاربر تیمچه",
    shortComment: "بسیار با کیفیت",
    offerToBuy: true,
    longComment:
      "این محصول رو برای باشگاه خریداری کردم چونکه نمیخواستم درگیر کیس هندزفری بشم و راحت روی گردنم میدازم از مزایای این محصول میتونم به صدای بسیار با کیفیت و اتصال آسان با هر دستگاه و نگهداشتن شارژ عالی اشاره کنم بعضی اوقات که پیاده به سرکار میرم هم از این محصول استفاده میکنم ویه جورایی معتاد این هندزفری شدم و این نکته رو هم اضافه کنم که قبل از این محصول چند هندزفری دیگر هم گرفتم که به گوش هام نمیخورد و میوفتاد اما این بسیار اوکیه پیشنهاد میکنم حتما بخرید",
  },
  {
    id: 9,
    userName: "کاربر تیمچه",
    shortComment: "بسیار با کیفیت",
    offerToBuy: true,
    longComment:
      "این محصول رو برای باشگاه خریداری کردم چونکه نمیخواستم درگیر کیس هندزفری بشم و راحت روی گردنم میدازم از مزایای این محصول میتونم به صدای بسیار با کیفیت و اتصال آسان با هر دستگاه و نگهداشتن شارژ عالی اشاره کنم بعضی اوقات که پیاده به سرکار میرم هم از این محصول استفاده میکنم ویه جورایی معتاد این هندزفری شدم و این نکته رو هم اضافه کنم که قبل از این محصول چند هندزفری دیگر هم گرفتم که به گوش هام نمیخورد و میوفتاد اما این بسیار اوکیه پیشنهاد میکنم حتما بخرید",
  },
  {
    id: 10,
    userName: "کاربر تیمچه",
    shortComment: "بسیار با کیفیت",
    offerToBuy: true,
    longComment:
      "این محصول رو برای باشگاه خریداری کردم چونکه نمیخواستم درگیر کیس هندزفری بشم و راحت روی گردنم میدازم از مزایای این محصول میتونم به صدای بسیار با کیفیت و اتصال آسان با هر دستگاه و نگهداشتن شارژ عالی اشاره کنم بعضی اوقات که پیاده به سرکار میرم هم از این محصول استفاده میکنم ویه جورایی معتاد این هندزفری شدم و این نکته رو هم اضافه کنم که قبل از این محصول چند هندزفری دیگر هم گرفتم که به گوش هام نمیخورد و میوفتاد اما این بسیار اوکیه پیشنهاد میکنم حتما بخرید",
  },
  {
    id: 11,
    userName: "کاربر تیمچه",
    shortComment: "بسیار با کیفیت",
    offerToBuy: true,
    longComment:
      "این محصول رو برای باشگاه خریداری کردم چونکه نمیخواستم درگیر کیس هندزفری بشم و راحت روی گردنم میدازم از مزایای این محصول میتونم به صدای بسیار با کیفیت و اتصال آسان با هر دستگاه و نگهداشتن شارژ عالی اشاره کنم بعضی اوقات که پیاده به سرکار میرم هم از این محصول استفاده میکنم ویه جورایی معتاد این هندزفری شدم و این نکته رو هم اضافه کنم که قبل از این محصول چند هندزفری دیگر هم گرفتم که به گوش هام نمیخورد و میوفتاد اما این بسیار اوکیه پیشنهاد میکنم حتما بخرید",
  },
];
